In [ ]:
import pandas as pd

# 01- How to find version

In [ ]:
# Check pandas version
pd.__version__

In [ ]:
# Another way to show pandas verison 
pd.show_versions()

 
# 02- Make a DataFrame

In [ ]:
df = pd.DataFrame({'Col A':[ 1,2,3], "Col B": [4,5,6]})
df

In [ ]:
# Array conversion to DataFrame
import numpy as np
array = np.array([[1,2,3], [4,5,6], [7,8,9]])
array

df = pd.DataFrame(array)
df

In [ ]:
# Creating a DataFrame with random floats 
df = pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))
df

# 03- How to rename a columns?

In [ ]:
# Creating a DataFrame with random integers and specific index and columns with names
df = pd.DataFrame(np.random.randint(1,11,size=(4,8))
                  ,columns=list("ABCDEFGH")
                  , index=['R1', 'R2', 'R3', 'R4'])
df

In [ ]:
df = pd.DataFrame(np.random.randint(1,21, size = (3,3)))
df

In [ ]:
# Change colums name
df.columns=['col1', 'col2','col3']
df

In [ ]:
# Change rows name
df.index=["Row-1", "Row-2", "Row-3"]
df

In [ ]:
# to replace any charactor or string
df.columns = df.columns.str.replace("-","_")

df

In [ ]:
# adding perfix in columns
df = df.add_prefix("A_")
df

In [ ]:
# adding suffix in columns
df = df.add_suffix("_X")
df

In [ ]:
df.columns=["col-1", "col-2", 'col-3']
df

# 04- Using tamplate data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

In [ ]:
# summary
df.describe()

In [ ]:
# columns name
df.columns

In [ ]:
# rows count
df.index

In [ ]:
# save DataFrame to CSV
df.to_csv("zyx.csv")

In [ ]:
# converted to excel
df.to_excel("xyz.xlsx")
df.head(3)

# 05- Using your own data

In [ ]:
# read from excel
df = pd.read_csv("zyx.csv")
df

# 06- Reverse rows order

In [ ]:
import pandas as pd
import seaborn as sns

In [ ]:
df = sns.load_dataset("titanic")
df.head(3)

In [ ]:
# reverse order
df.loc[::-1].head()

In [ ]:
# reset index 
df.loc[::-1].reset_index(drop=True).head()

# 07- Reverse columns order

In [ ]:
df.loc[:, ::-1].head(3)

# 08- Select a colum by data type

In [ ]:
# select only numeric columns
df.select_dtypes(include=["number"]).head()

In [ ]:
# select only categoryical value
df.select_dtypes(include=['category']).head()

In [ ]:
# select only object type columns
df.select_dtypes(include='object').head()

In [ ]:
#select only Float64 type columns
df.select_dtypes(include='Float64').head()

In [ ]:
# select only number and category type columns
df.select_dtypes(include=['number', 'category']).head(3)

In [ ]:
# select all columns except number type
# This will include all non-numeric columns such as object, category, etc.
df.select_dtypes(exclude=['number']).head()

In [ ]:
# select all columns except category type
# This will include all non-category columns such as object, number, etc.
df.select_dtypes(exclude=['category']).head()

# 09- convert numaric into string

In [ ]:
#
df = pd.DataFrame({ "col_A" :[1,2,3,4,5],
                   'col_B' :[6,7,8,9,10]})
df.dtypes

In [ ]:
# Convert column 'col_A' to string type and 'col_B' to string type
df.astype({'col_A': 'str', "col_B": 'str'}).dtypes

In [ ]:
# Convert column 'col_A' to numeric type, coercing errors means that if there are any non-numeric values, they will be replaced with NaN
pd.to_numeric(df['col_A'],errors="coerce")

# 10- Reduce DataFrame size

In [ ]:
# reduce the DataFrame to a sample of 10% of its rows
df = sns.load_dataset('titanic')

df.sample(frac=0.1).shape
df.info()

# 11- copy DataFrame from clip board

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.to_excel("titanic_sample.xlsx", index=False)

In [ ]:
# read from clipboard
df = pd.read_clipboard()
df

# 12- Split dataframe in two subsets

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

In [ ]:
from random import random
df_1 = df.sample(frac=0.50, random_state=1 )
df_1.shape

In [ ]:
df_2 = df.drop(df_1.index)
df_2.shape

In [ ]:
df_1.head(4)

In [ ]:
df_2.head(4)

In [ ]:
df_1.shape

In [ ]:
df_2.shape

In [ ]:
len(df_2) + len(df_1)

# 13- Concat two datasets in one dataframe

In [ ]:
df = pd.concat([df_1, df_2])
df.shape

# 14- Filtering a dataframe

In [ ]:
df.head()

In [ ]:
df.sex.unique()

In [ ]:
df[(df.sex=="male")]

In [ ]:
df.who.unique()

In [ ]:
df[(df.who=='child') & (df.age>14)]

In [ ]:
df[(df.alive=='yes')].shape

In [ ]:
df[(df.alive=='no')].shape

In [ ]:
df.head()

In [ ]:
df[
    ( (df.embark_town == 'Southampton') ) |
    ( (df.embark_town == 'Queenstown') & (df.alone == "True") )
]

In [ ]:
filter_df = df [(
    (df.age >= 18) &
    (df.sex == "female") &
    (df.alive == 'yes')

)]

In [ ]:
result = filter_df[['age', 'sex', 'alive']]
result

# 15- Filter by large category

In [ ]:
df.sex.value_counts()

In [ ]:
df.alive.value_counts()

In [ ]:
df.alone.value_counts()

In [ ]:
df.age.value_counts().nlargest(4)

In [ ]:
df.age.value_counts().nsmallest(4).index

# 16- Spliting a string into multiple columns

In [ ]:
df = pd.DataFrame({"name": ['Ali Raza','Junaid Maseed','Ajmal Afridi'],
                   "address": ['palosa Peshawar', 'warirstan england', 'Hassen khel'] })

df [['First_name', 'Last_name'] ] = df.name.str.split(' ' ,expand=True)

In [ ]:
df

In [ ]:
new_df = df[['Village', 'State']] = df.address.str.split(' ', expand=True)

In [ ]:
new_df

In [ ]:
df

In [ ]:
# Refine data maniplution
df = df [['First_name', 'Last_name', 'Village', 'State']]
df

# 17- Aggregate by multiple group/function

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')

In [ ]:
df.groupby('who').count()

In [ ]:
df.groupby('sex').count()

In [373]:
len(df.groupby('who'))

3

In [378]:
df.groupby(['who', 'sex']).count()

              survived  pclass  age  sibsp  parch  fare  embarked  class  \
who   sex
child female        43      43   43     43     43    43        43     43
      male          40      40   40     40     40    40        40     40
man   male         537     537  413    537    537   537       537    537
woman female       271     271  218    271    271   271       269    271

              adult_male  deck  embark_town  alive  alone
who   sex
child female          43     6           43     43     43
      male            40     7           40     40     40
man   male           537    99          537    537    537
woman female         271    91          269    271    271

In [379]:
df.groupby(['sex', 'who', 'alone']).count()

                    survived  pclass  age  sibsp  parch  fare  embarked  \
sex    who   alone
female child False        38      38   38     38     38    38        38
             True          5       5    5      5      5     5         5
       woman False       150     150  123    150    150   150       150
             True        121     121   95    121    121   121       119
male   child False        39      39   39     39     39    39        39
             True          1       1    1      1      1     1         1
       man   False       127     127  110    127    127   127       127
             True        410     410  303    410    410   410       410

                    class  adult_male  deck  embark_town  alive
sex    who   alone
female child False     38          38     6           38     38
             True       5           5     0            5      5
       woman False    150         150    56          150    150
             True     121         121    35          119    121
male   child False     39          39     7           39     39
             True       1           1     0            1      1
       man   False    127         127    41          127    127
             True     410         410    58          410    410

# 18- Selet spicific rows and columns

In [387]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# columns selction
df[['sex', 'class']]

        sex   class
0      male   Third
1    female   First
2    female   Third
3    female   First
4      male   Third
..      ...     ...
886    male  Second
887  female   First
888  female   Third
889    male   First
890    male   Third

[891 rows x 2 columns]

In [381]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
# rows selction
df.describe().loc[['max', 'min']]

     survived  pclass    age  sibsp  parch      fare
max       1.0     3.0  80.00    8.0    6.0  512.3292
min       0.0     1.0   0.42    0.0    0.0    0.0000

In [ ]:
df.describe().lo